#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "59109529b862405026ab30a212337945" -> "142bf22647b3d9206da32ec8c4f3906e"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "786afdfc5e23db22c60e3cdce976bd29" -> "7bb513f66ed2206b0696023165aa0651"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "bc6d00cd2d6ef20e5d0f044bec43317b" -> "7b019bf124888667ce0257be611bfcb7"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d8a7065af7797eeccc8e1f6474a2cda9" -> "7eeb025b4563a33f111eb18ad64b00d5"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "ce8e66d7929d3bed051db73d1336882a" -> "acf3aa1d830da17c91f6f72bd3cc44c7"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "8d1f4fb13d8b69d716945640695aae4c" -> "2431ade142b85e075194f0120e20d0ed"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "640ef1d30cc8c676602d77ad43a2df24" -> "f10397eb0e1559bed8a348da5ba3b578"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "7243ba16cfeda405a39b5a157122a431" -> "206f5dbf309dbb052657495d5e8c5961"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "183ed4596bce81a9d1b0706ec05b2707" -> "d4e35cce2d1c228f59c703014c8649cd"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "0f4705f5c47bb28ecd25d1d5911e7fbf" -> "114ee643b5a19d8df6362c9bba1a2159"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "24447e3c0ef8c03862445f4903e53c97" -> "d745326c19057c16cbb179725037ca0f"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "d20b0be2832af54fb8c780b5df0ec8d0" -> "de442fbbcb117168a7f38eaf68231d1b"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "42943f032cda67ff70ec103f7eff6822" -> "04366a707eb6fdd05c70cadb7b349335"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "9eb0bc7abb1305fcce24c794c0d93106" -> "238a378e9630152be63aed3c345187ab"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "ebb647ba701ae70603275d7d3705e3b3" -> "6fc2b78ab79150fc0763c2ef31b464ac"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "fd670b88e6d400d4e5106e22bdf9b681" -> "0cc70a34f7907dbee9fe74a0ad3ce2a9"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "0386cc15e103c255d1e497db5e5d470e" -> "168cd19da7cafddbc5ae32e2c79ff036"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "be4cd198f204f6dfdc7f79103a6550fb" -> "a8f31177c824a35ba4fe8cdfb66eb520"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "df53a95efdc4752a3d259d7ad2ce2f52" -> "8a1a3470d5472681e4427cff32e72cd3"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "8bbc7213914231237e3cb8a6ddb0c637" -> "4265a1a9ec093f3171ab2a38c690bb69"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "7f477898286c1c9d99e04018c9734635" -> "8ba8865ff3c886984c8850156d381aa8"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "b3eb58e90b2bc5d259d9500d75581d0e" -> "36ed546a94bb3308734ffebc5fc09306"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "9172ed92b557543afb85d7b494e66389" -> "e51f54e622593a3db7e4a55948b6ec5a"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "f82782064b776f5002981133805ed64c" -> "3a888aed50dcac16db7820f4ed076517"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "9788ff6d2a0acf4ab10ee94fde39b897" -> "a80dc4f028601b206760fab45ec14c21"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "03e1e9a10ea957801e7018fc347b0928" -> "0c58a8ce97736e37c83062ffe1f45c92"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "153794310a7533ac14603649f0efcf56" -> "397b1607de072ac3ea3555fd8831297b"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "bffb163b6cadf2caef714c42f78b2771" -> "d46e7babef22bcabea41ec670833370b"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "fdd82b856b9ab1a7dc04a61c939503fa" -> "9872f6867aa21f254fc7d666fe89c3e9"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "0c81b05a67d63b7e74331bfc7e39e4ba" -> "f401d63db25271b0047fc8a64d4086fe"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "b653cf6c8be483286da4a68dff4406c1" -> "f560534cd49f5e01aece58a56eba1009"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "0c3845ef2cf149f4ddaadde56818c310" -> "0587dc10a05a75655000ed907d337a3f"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "4dab210569d0cdea4c341bf5d468b6f2" -> "4dd5afb633e0abb3bf4a268831a5d106"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "1c76021e4b9f2acc5357abab82e0896e" -> "8db62e4815c8b38d70d569182f401b06"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "4fd3d4974ddcee3a3299873520e1b1a5" -> "328b1f01da7e791cf0daf9b75eb5a31c"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "bc272945b588d69a731b9f0f1fac5a06" -> "55db94d257c9c77601897e3e3481da32"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "e9721a7ae621d772e52c529a73dbaeef" -> "0460a4c0686c2c539f7c39ba9308e84b"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "826cc90e0e174f700a8631ffddcb7bb3" -> "3e5055b85281c4672e802ce36cc251f7"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "67bd988e9bd93d734e50df14a6613566" -> "97aaf499cae2094fa5fe96f86ecdc42e"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "a90fe34b6a1a7937e76e2c73a454cee4" -> "4f11188f1f176541ad77566ff7b20470"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "de7a6f2d947b9e405f8ae44ffe88f70f" -> "07a48c4a1f2c5a409bec25fd3d4d4d10"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "02185a01236ba10490afa6e8c3d33e24" -> "6618bead76a22783817b8d6b91e534a6"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "cf91d98537a20fceedc6e8ca0964fba4" -> "668a6228ac98f00f79880576734788b4"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "3cfddd7419887b8dc1aa3fbd79cc2e7e" -> "8addbf96f6f28fc3d23e9a6531756882"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "688a2fcce0ca4ddea38fb64913fdcf69" -> "1af769e1c7c6732a9a95564859d09976"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "5a7785e5ce20354666bd0b1bdef918fe" -> "084b3668323610a44ed14cf13e00081d"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "7b23273347bc213cb703c5a7ee5f4a43" -> "14528703c7c0e881c9bc80b9ce462b98"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "sCoikEC30zvJMt1/fCPQb2iFxpmSFBPEBDnZlxTwXSo=" -> "LrT6lvT/iD53Mtf3m8wJEmMH6Q9h/nu5mBxcDL7Q2nI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "JiD2k6IcPCKtaouMcFIxa5W7itysuz5oU7p6YSxxJzM=" -> "15aLHLNqZiQQCZE5F26E7TUOugrKAo2XqCLonJ0Eq3Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCuH9F3lFVh7q7bG48HfVjAWJwDVKJ6sfHZwr1Tdd74=" -> "gYtZg1jovUUb5oZPBnXqiKYzWRQ4vC8USVlTBpMMRMU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "38p1DgXoHWHdvNYCaWxi73oWcA/HuyOVkIT5oEAUA48=" -> "+I+6AbuYxXLaE7rWiWCY/2sVty1JArNGVDy/1DM3ivM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qvkQC5ijMEO53xTeMPnDmHdxom2r8LpxJOWiHteT4Yo=" -> "jye689XQmwkNhnUX7klWy87iyvaDg37VOnf8xdsVVSM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWZFICI16Mmnitls4oICL9gJGxRmHUbtdIA2WMb+yt8=" -> "WUINsYc38kpAs/mfV6KP5jGeBX/eHmPbHWRRdt+St3I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "NWjIrj+RRvnfUL1FDgQca3zatoqvyji7stfgatWySj0=" -> "bY9IjzTi415wlyHWKrXGvEviUslNvTQx1aZSM3qOxvU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "c8+fyGXo6On9CVDsENNC3DzLE3hqtVuAuwwIsaEaa6c=" -> "Pyh0PTRva3BPxG4lkYJZOuBTZM3WsySy+5vIXOJmKJw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yKvHYEcpKRSyX7rnGyF6B7IGKoh+vdltaGY3rpcqdKo=" -> "ii+AndiIRCK/vXiv4bJ746EdSglP+Li5JOCIw0NCOzk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "qojgTDYT6Ub0KKt7905ehhRw0KkOarA8RoWyHnBd+vA=" -> "svCD5x/xEsy2jSKqmQqk8R6mW/0OzsfEgWm7r1NeJMM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ2dZzrcamyTXC7o9acgxyKCTewbdB56Mdd2+BwyQ/8=" -> "azRdMueXUrI5TeSr6zwhHemnJ85TEsBrXrZfRythfdA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "6GiMO4XimdCmYkQt8vfTM4REHKSLRKCQGTU9OQqTjn0=" -> "0dy7IARTSxhaajJeKevHAIOUKlNiE4qhtmBxjRp0m/U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ3TypB3WSmN22FAI2IZqF7nTNfSEAmDtEti/alRq+I=" -> "M0b1Bp/fVu9Q9Z47+wg3DipPrv1cJ5tjDO5iXfbA2Mw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "p7tKz+J81GNbBZ5DFM816T6q3O6k4PdeYnNKLYTNojs=" -> "S5m9TkcKfbxDMxkPQdBU/SjjtrFwJwg1r20K6gLB6Nk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "/xyE9vXplVnn/dG+DDp4h7H2h2m6ERMh7g0fI17N2Hc=" -> "DotpB+SvHqI3Zgn6TdSYmlCOBTSlgqDh7XkUnbNSrpA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "xa/302K44/xgMEo/c7iW79y+8xTh+jf6cjxrzCVXohc=" -> "t3EYRHlzIkdWM7HsK98nLEJjQLk61/IsU3lw73ElNzk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xp4m5RykDHlvFYKP774h1NMLN1WdUcTXaWZPopu2B/Q=" -> "zAirQPgzzAUXzBQTacsWar5s9jLOuSkkGyDuOfmLIec="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "FofZCyh15v+D3Ezz1gbtARiSATUmk0fluwfzsw9BoX0=" -> "PEDkdZQPtR4vBRB/h1N7GmuahWNkEIoH3Q1V5sicF8M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "UUcCiNdh6txDzYU/A5vM9tmVCd5WAPOBOjxGDBaEvHc=" -> "8AQkO595sNWL308IFghvJGN4uzV2Z0r0oU5Pv7yFgAM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:34:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "2KOgushnSteholebq0lNY95fEqJvutNKhwLiScwreRw=" -> "KP+7VbVYyISxHlLckcJWhbeulKHfY3T/oHIOE9R+HXE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "C7K82XGHsQachb5phRs+jwGr/BriEG8/M6c2zFYg1Io=" -> "/8dACa6zeamUU8ExS5MDrJ31gBICpvRp7+rsqPALghg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "RuBPGp+2SuMbTRSVt9Smj1gmVjKyZDLn3cQeMH1vY+c=" -> "ZQVX79KUBDQzS3BseyqlhS/EdSSO/vhEwqK/S8lyhRM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "GEe0ku9n4Osbe6BbfAoT5fpe/3SzzxKBcGWDeu6iyko=" -> "KLG7govruEtl8JshA8a6YR8+1nKpBXEMvtB1Sxu7PmU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "SH01WAsAaKusxQXaoOG6TikVVzCHCijE4C+xfcAHpWU=" -> "1SEPF5wf7HiJmNFI0G99THsBPAT91GhoKtwoWt34Rxc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "BbbEesoy20k7RNHw/kC4rpml+rCef/bpY+nsqdUcR4w=" -> "meaQybKyO/ilnhzn01CS/yqYvNrlv2s6Qi7rPa5kRj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:50:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "7lec+69anKp+qySn71v4lYZExCLquN/6gek4R0VPEO4=" -> "divq9gZmE8kMhiWRo3GgTkmA+AWbouT5NtpnyF1JcvQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ca7VqEBRd1sG8L+24gex6ElrC1rZneDTCuguZG+H2hY=" -> "mj7Z/KU9RL5kTutadGDKgcFrTMDjBEe0BjOH/RL+Hsc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JWHxTlg5Q+Z+R2LZrT3qqWgXn0+WfWbYe6Zlwsvvrlw=" -> "qd/eT3ZB++0//MdJb6OdMwHaX0VjT8GewEqRz5tV85w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:40:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "FzOz6jOnS4O7JoKkeXcAvZorfBUo1oJbyYvkIDZy6Gw=" -> "x33fIybbGcgE6rH3O3a+uVacS9d+ges3veVh6HhnmLk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "s1jtTsgLy8BLv6GdDOREYLMASbYG5U9WKaoYKl8ECkE=" -> "F0Qoo3zMzTPX5Ejp1ffs3E6QkeGyz15Zg+fgluL9vJw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-23T18:43:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "pThIoC4pBqBX/bccnbZCxGBT0cp9JVZ5/afOIK/CM9Y=" -> "WaBL2YeDoa9hredI8nxdxivQWkMJ90CcSOC4hZLSRf0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "YckJBSVlrHUF9UtqxJRUYxsLU7rvpsNsy9Wiy/RiXtA=" -> "dpQmAgts4rwRhWtKk13uJixlW5FxffXansH98Rf9GMo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "alVJxTV2UeyfGMInaIxRmlO7TF7dO1UcOsT+TKCeMhc=" -> "POW9ZAUigRKjU/EyJn1JgYbp6GYtcsuWGuDgv0e4qiw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGmehOTAedxtpxhdFrfmTMUNGNKV2Lp/rkYdv0R+nI=" -> "MvaB992qZv/Eh/pc6zpL3IQNismYXjmw8qut/5IvcUE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOkK10OtJWgsmxfz9CyYLuYJjxahZGDWBZYIh5cnjZA=" -> "s06Phv6gfEvWjeTvuMd6/gtQGvr0ZTj2RcQb5u3xcog="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "BryM2VMY//KXPI3EEH2wI2gLXF4tH0r6o+EyM9Der8s=" -> "fasNytiiqyMdMT+ByVuNW+AivSrI6urIUlpc5B2Wogw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "PbcWe7E7x1wr9o/AJsWFMaTtAOTHyNulY3qJrpWAut0=" -> "bGa6qiLC0nRwumzd0ifKFBPsWnoGHXCYeE4YC6mWpa8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "vVA+iG7OQml6x7DcX1LmzbdC65UGazOKOUa1EIrm96s=" -> "6gU0R3qJo2v7Fk8ugk/L+0IEQ/BTZIa989Ph9l0LSIw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "CUGIJeH8habHelQZRnOsdcguCCd9gDJwqrw54ECUmr4=" -> "K8wbMJeo8cerVdmYco+5PkIdXnzKoJ0Y4wwgfwJOg+0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "iJGpKfKBl+g8pnQwU/Kk9Q1w4wVjK/ngzIcqQQS2bXw=" -> "Nm+yiaz2UF98kxwlcVUBnJZJnRzhpfXZfMjllmon+jU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "t1seLdabUX3/GrwSkeDP8iEQhKwxT9ZqSnAvuiVHQCE=" -> "hXVWs3UKL68lpBfR46KQkKA3HfttcyGMvAosE+IrdYQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZPb0rkNMduUtZTNn/LVoocUtJddONklR07wYXGiSmA=" -> "J19zhWehKikZzHdOBn2I3/lBSwpthG6tYXdCxW3WDEI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2s+HdSlOcREm2D4nc3bProI1iDwON1DVe08x0BR2Ow=" -> "IB1rgTIflNQwzxIWI+KfYB5kO2DjqD4FUdLEAwrMiQo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "vKAgt2/WRVYqi+8/QYFrI1lMaLjJqGhw+kxNapAYJV4=" -> "xgpPs61UsmBWek66GcWsxeXiaehGBPSGJtxV4w9j1wE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ehKYQXHsw3KWgfz6nWFXs/NeTJlz3xbCnPg+n61pNmg=" -> "p5IcktTW62ItF8b81QBHbvUiuQw90tEnwKLvrJAQAqo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "64Xsh0e/Kv90AgznN7CuKYLYv8KNYLpk+2CFGHm/A74=" -> "niJaRTMKEFfasreNrmDDyKp0aMd0V/koOyqwUzvmI4o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-17T14:53:29Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7xufwb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*